; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v1 - type_1 ?v2 - type_3)
 	      (pred_2 ?v8 - object ?v2 - type_3)
	      (pred_3 ?v1 - type_1 ?v7 - type_2)
	      (pred_4 ?v1 - type_1 ?v8 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v1 - type_1 ?v4 ?v6 - type_3)
       :precondition (and  (pred_1 ?v1 ?v4))
       :effect (and  (pred_1 ?v1 ?v6)
		     (not (pred_1 ?v1 ?v4))))

   (:action op_3
       :parameters (?v1 - type_1 ?v5 - object ?v3 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v3) (pred_1 ?v1 ?v3) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v3)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_1 ?v5 - object ?v3 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v7) (pred_1 ?v1 ?v3))
       :effect (and (pred_2 ?v5 ?v3)
		    (pred_3 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_04 obj_09 - type_2
obj_01 obj_03 obj_06 - type_3
obj_08 obj_02 obj_07 - object)
(:init
(pred_1 obj_05 obj_06)
(pred_3 obj_05 obj_04)
(pred_3 obj_05 obj_09)
(pred_2 obj_08 obj_01)
(pred_2 obj_02 obj_01)
(pred_2 obj_07 obj_03)
)
(:goal
(and
(pred_2 obj_08 obj_01)
(pred_2 obj_02 obj_01)
(pred_2 obj_07 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_05 ?b obj_09))))
)
)

; plan
1. (op_1 obj_05 obj_06 obj_03)
   deleted: (pred_1 obj_05 obj_06)
   added: (pred_1 obj_05 obj_03)
   goals met: 2 of 3
2. (op_3 obj_05 obj_07 obj_03 obj_04)
   deleted: (pred_2 obj_07 obj_03) (pred_3 obj_05 obj_04)
   added: (pred_4 obj_05 obj_07 obj_04)
   goals met: 2 of 3
3. (op_1 obj_05 obj_03 obj_06)
   deleted: (pred_1 obj_05 obj_03)
   added: (pred_1 obj_05 obj_06)
   goals met: 2 of 3
4. (op_2 obj_05 obj_07 obj_06 obj_04)
   deleted: (pred_4 obj_05 obj_07 obj_04)
   added: (pred_2 obj_07 obj_06) (pred_3 obj_05 obj_04)
   goals met: 3 of 3
